# task 01 == Виправте синтаксичні помилки
print("Hello", end = " ")
print("world!")

# task 02 == Виправте синтаксичні помилки
hello = "Hello"
world = "world"
if True:
    print(f"{hello} {world}!")

# task 03  == Вcтавте пропущену змінну у ф-цію print
for letter in "Hello world!":
    print("Hello world!")

# task 04 == Зробіть так, щоб кількість бананів була
# завжди в чотири рази більша, ніж яблук
apples = 2
banana = apples * 4

# task 05 == виправте назви змінних
storona_1 = 1
storona_2 = 2
storona_3 = 3
storona_4 = 4

# task 06 == Порахуйте периметр фігури з task 05
# та виведіть його для користувача
perimetery = storona_1 + storona_2 + storona_3 + storona_4
print(perimetery)


"""
    # Задачі 07 -10:
    # Переведіть задачі з книги "Математика, 2 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в другому класі
"""
# task 07
"""
У саду посадили 4 яблуні. Груш на 5 більше яблунь, а слив - на 2 менше.
Скільки всього дерев посадили в саду?
"""
# У саду посадили 4 яблуні
apple_trees = 4

# Також посадили груші, на 5 більше чим яблунь
pear_trees = apple_trees + 5

# Та сливи, на 2 менше чим яблунь
plum_tree = apple_trees - 2

# Підрахуємо кількість дерев у саду
trees_sum = apple_trees + pear_trees + plum_tree
print("Усього дерев у саду:", trees_sum)


# task 08
"""
До обіда температура повітря була на 5 градусів вище нуля.
Після обіду температура опустилася на 10 градусів.
Надвечір потепліло на 4 градуси. Яка температура надвечір?
"""

# До обіду температура була на 5 градусів вище нуля
temp_before_lunch = 0 + 5

# Після обіду температура опустилася на 10 градусів
temp_after_lunch = temp_before_lunch - 10

# Порахуємо температуру ввечері, враховуючи що вона піднялася на 4 градуси
temp_during_evening = temp_after_lunch + 4
print("Температура ввечері:", temp_during_evening)


# task 09
"""
Взагалі у театральному гуртку - 24 хлопчики, а дівчаток - вдвічі менше.
1 хлопчик захворів та 2 дівчинки не прийшли сьогодні.
Скількі сьогодні дітей у театральному гуртку?
"""

# Знайдемо кількість дівчаток враховуючи що хлопчиків 24, а дівчат вдвічі менше
boys_group = 24
girls_group = boys_group / 2

# Порахуємо загальну кількість дітей у гуртку додавши кількість дівчаток та хлопчиків
kids_quantity_sum = boys_group + girls_group

# Підрахуємо скільки сьогодні дітей у гуртку враховуючи що 1 хлопчик захворів та 2 дівчинки не прийшло
kids_present = kids_quantity_sum - 1 + 2
print("Усього дітей присутньо:", int(kids_present))


# task 10
"""
Перша книжка коштує 8 грн., друга - на 2 грн. дороже,
а третя - як половина вартості першої та другої разом.
Скільки будуть коштувати усі книги, якщо купити по одному примірнику?
"""

# Перша книжка за 8 грн., підрахуємо скільки коштує друга враховуючи що вона на 2 грн. дешевша
first_book = 8
second_book = first_book - 2

# Підрахуємо вартість третьої книжки враховуючи що вона коштує половину вартості першої та другої разом
third_book = (first_book + second_book) / 2

# Підрахуємо суму вартості усіх книжок якщо ми купимо по 1 примірнику кожної
books_price_sum = first_book + second_book + third_book
print("Вартість усіх книжок разом:", int(books_price_sum), "грн.")